{
  "id": "L10U04NAE",
  "slug": "local-customs-etiquette-travelers",
  "title_ar": "عادات وتقاليد محلية: نصائح للمسافرين لتجنب المواقف المحرجة",
  "title_en": "Local Customs & Etiquette: Tips for Travelers to Avoid Awkward Situations",
  "title_tr": "Yerel Gelenek ve Görenekler: Seyahat Edenler İçin Garip Durumlardan Kaçınma İpuçları",
  "objective_ar": "التعرف على أهمية فهم واحترام العادات والتقاليد المحلية عند السفر، مع أمثلة لعبارات أساسية للتأدب والتقدير.",
  "objective_en": "Understand the importance of understanding and respecting local customs and etiquette when traveling, with examples of basic polite and appreciative phrases.",
  "objective_tr": "Seyahat ederken yerel gelenek ve göreneklere saygı duymanın ve anlamanın önemini, temel kibar ve takdir ifadeleri örnekleriyle kavrayın.",
  "icon_fa_class": "fa-solid fa-handshake",
  "scenario": null,
  "phrases": [
    {"id": "L10U04_P001", "category_ar": "إظهار الاحترام والتقدير", "ar": "من فضلك (عند الطلب). / شكرًا لك/جزيلاً. / على الرحب والسعة.", "en": "Please (when requesting). / Thank you / very much. / You're welcome.", "tr": "Lütfen (talep ederken). / Teşekkür ederim / çok. / Rica ederim.", "audio_ar_tts_key": "من فضلك. شكرا لك. شكرا جزيلا. على الرحب والسعة", "audio_en_tts_key": "Please. Thank you. Thank you very much. You're welcome.", "audio_tr_tts_key": "Lütfen. Teşekkür ederim. Çok teşekkür ederim. Rica ederim."},
    {"id": "L10U04_P002", "category_ar": "إظهار الاحترام والتقدير", "ar": "عفوًا/معذرة (للفت الانتباه أو عند المرور). / أنا آسف (لخطأ بسيط).", "en": "Excuse me (to get attention or pass by). / I'm sorry (for a minor mistake).", "tr": "Affedersiniz (dikkat çekmek veya geçerken). / Üzgünüm (küçük bir hata için).", "audio_ar_tts_key": "عفوا. معذرة. أنا آسف.", "audio_en_tts_key": "Excuse me. I'm sorry.", "audio_tr_tts_key": "Affedersiniz. Üzgünüm."},
    {"id": "L10U04_P003", "category_ar": "التأدب في الأماكن العامة", "ar": "نصيحة: راقب سلوك السكان المحليين وحاول تقليده. خفض صوتك في الأماكن الهادئة. اطلب الإذن قبل تصوير الأشخاص.", "en": "Tip: Observe and try to emulate local behavior. Keep your voice down in quiet places. Ask for permission before photographing people.", "tr": "İpucu: Yerel halkın davranışlarını gözlemleyin ve taklit etmeye çalışın. Sessiz yerlerde sesinizi alçak tutun. İnsanların fotoğrafını çekmeden önce izin isteyin.", "audio_ar_tts_key": "نصيحة: راقب سلوك السكان المحليين وحاول تقليده.", "audio_en_tts_key": "Tip: Observe and try to emulate local behavior.", "audio_tr_tts_key": "İpucu: Yerel halkın davranışlarını gözlemleyin ve taklit etmeye çalışın."},
    {"id": "L10U04_P004", "category_ar": "البقشيش (الإكرامية)", "ar": "نصيحة: ابحث عن عادات البقشيش في البلد الذي تزوره. في بعض الأماكن هو متوقع، وفي أخرى قد لا يكون شائعًا أو يُضاف تلقائيًا للفاتورة.", "en": "Tip: Research tipping customs in the country you're visiting. In some places it's expected, in others it may not be common or is automatically added to the bill.", "tr": "İpucu: Ziyaret ettiğiniz ülkedeki bahşiş geleneklerini araştırın. Bazı yerlerde beklenir, bazılarında yaygın olmayabilir veya otomatik olarak faturaya eklenebilir.", "audio_ar_tts_key": "نصيحة: ابحث عن عادات البقشيش في البلد الذي تزوره.", "audio_en_tts_key": "Tip: Research tipping customs in the country you're visiting.", "audio_tr_tts_key": "İpucu: Ziyaret ettiğiniz ülkedeki bahşiş geleneklerini araştırın."},
    {"id": "L10U04_P005", "category_ar": "الملابس المحتشمة", "ar": "نصيحة: عند زيارة الأماكن الدينية أو المناطق المحافظة، يُفضل ارتداء ملابس محتشمة تغطي الكتفين والركبتين.", "en": "Tip: When visiting religious sites or conservative areas, it's advisable to wear modest clothing that covers shoulders and knees.", "tr": "İpucu: Dini yerleri veya muhafazakar bölgeleri ziyaret ederken, omuzları ve dizleri örten mütevazı giysiler giymeniz tavsiye edilir.", "audio_ar_tts_key": "نصيحة: عند زيارة الأماكن الدينية ارتدِ ملابس محتشمة.", "audio_en_tts_key": "Tip: When visiting religious sites wear modest clothing.", "audio_tr_tts_key": "İpucu: Dini yerleri ziyaret ederken mütevazı giysiler giyin."},
    {"id": "L10U04_P006", "category_ar": "السؤال بأدب", "ar": "هل يمكنني أن أسألك سؤالاً؟ / هل تمانع إذا...؟ / هل هذا مسموح به هنا؟", "en": "May I ask you a question? / Would you mind if I...? / Is this allowed here?", "tr": "Size bir soru sorabilir miyim? / ...yapsam sakıncası olur mu? / Bu burada yasak mı/serbest mi?", "audio_ar_tts_key": "هل يمكنني أن أسألك سؤالا هل تمانع إذا هل هذا مسموح به هنا", "audio_en_tts_key": "May I ask you a question? Would you mind if I? Is this allowed here?", "audio_tr_tts_key": "Size bir soru sorabilir miyim? yapsam sakıncası olur mu? Bu burada yasak mı?"}
  ]
}