{
  "id": "L01U06ACN",
  "slug": "managing-difficult-conversations-negotiations",
  "title_ar": "إدارة الحوارات الصعبة والمفاوضات المتقدمة",
  "title_en": "Managing Difficult Conversations & Advanced Negotiations",
  "title_tr": "Zor Konuşmaları ve İleri Düzey Müzakereleri Yönetme",
  "objective_ar": "تطوير المهارات اللغوية والاستراتيجيات للتعامل مع المحادثات الصعبة، التعبير عن وجهات النظر المعارضة بأدب، والتفاوض بفعالية للوصول إلى نتائج مرضية.",
  "objective_en": "Develop linguistic skills and strategies for handling difficult conversations, politely expressing opposing views, and negotiating effectively to achieve satisfactory outcomes.",
  "objective_tr": "Zor konuşmalarla başa çıkmak, karşıt görüşleri kibarca ifade etmek ve tatmin edici sonuçlar elde etmek için etkili bir şekilde müzakere etmek için dil becerilerini ve stratejilerini geliştirin.",
  "icon_fa_class": "fa-solid fa-people-arrows-left-right",
  "scenario": {
    "title_ar": "حوار: التفاوض على شروط مشروع مع عميل صعب المراس",
    "title_en": "Dialogue: Negotiating Project Terms with a Difficult Client",
    "title_tr": "Diyalog: Zor Bir Müşteriyle Proje Şartlarını Müzakere Etme",
    "characters": [
      {"id": "pm", "name_ar": "مدير المشروع (خالد)", "name_en": "Project Manager (Khalid)", "name_tr": "Proje Yöneticisi (Halit)"},
      {"id": "client", "name_ar": "العميل (السيد طارق)", "name_en": "Client (Mr. Tariq)", "name_tr": "Müşteri (Tarık Bey)"}
    ],
    "dialogue_lines": [
      {"character_id": "pm", "line_ar": "صباح الخير سيد طارق. شكرًا على وقتك. أردت مناقشة الجدول الزمني والميزانية المقترحة لمشروع [X].", "line_en": "Good morning, Mr. Tariq. Thank you for your time. I wanted to discuss the proposed timeline and budget for Project [X].", "line_tr": "Günaydın Tarık Bey. Vaktiniz için teşekkür ederim. Proje [X] için önerilen zaman çizelgesini ve bütçeyi görüşmek istemiştim."},
      {"character_id": "client", "line_ar": "أهلاً خالد. نعم، اطلعت على المقترح. بصراحة، الجدول الزمني يبدو طويلاً جدًا، والميزانية أعلى مما توقعت.", "line_en": "Hello Khalid. Yes, I've reviewed the proposal. Frankly, the timeline seems quite long, and the budget is higher than I anticipated.", "line_tr": "Merhaba Halit. Evet, teklifi inceledim. Açıkçası, zaman çizelgesi oldukça uzun görünüyor ve bütçe beklediğimden daha yüksek."},
      {"character_id": "pm", "line_ar": "أتفهم مخاوفك بشأن الجدول الزمني والميزانية، سيد طارق. اسمح لي أن أوضح الأسباب. نطاق العمل يتضمن [تفصيل 1] و [تفصيل 2]، وكلاهما يتطلب وقتًا وجهدًا كبيرين لضمان الجودة.", "line_en": "I understand your concerns regarding the timeline and budget, Mr. Tariq. Allow me to elaborate on the reasons. The scope of work includes [Detail 1] and [Detail 2], both of which require significant time and effort to ensure quality.", "line_tr": "Zaman çizelgesi ve bütçeyle ilgili endişelerinizi anlıyorum Tarık Bey. İzninizle nedenlerini açıklayayım. İşin kapsamı [Detay 1] ve [Detay 2]'yi içeriyor ve her ikisi de kaliteyi sağlamak için önemli ölçüde zaman ve çaba gerektiriyor."},
      {"character_id": "client", "line_ar": "أقدر ذلك، ولكن لدينا موعد نهائي صارم من جهتنا. هل هناك أي مجال لتقليص الجدول الزمني دون المساس بالجودة الأساسية؟", "line_en": "I appreciate that, but we have a strict deadline on our end. Is there any room to shorten the timeline without compromising core quality?", "line_tr": "Bunu takdir ediyorum, ancak bizim tarafımızda katı bir son teslim tarihimiz var. Temel kaliteden ödün vermeden zaman çizelgesini kısaltmak için herhangi bir alan var mı?"},
      {"character_id": "pm", "line_ar": "لتسريع الأمور بشكل كبير، قد نحتاج إلى زيادة عدد أفراد الفريق المخصص للمشروع، وهو ما قد يكون له تأثير إضافي على الميزانية. بديل آخر هو أن نعيد النظر في بعض الميزات الأقل أهمية ونؤجلها لمرحلة لاحقة.", "line_en": "To significantly expedite things, we might need to increase the team members allocated to the project, which could have an additional budgetary impact. Another alternative is to reconsider some less critical features and postpone them to a later phase.", "line_tr": "İşleri önemli ölçüde hızlandırmak için projeye tahsis edilen ekip üyesi sayısını artırmamız gerekebilir, bu da bütçeye ek bir etki yapabilir. Başka bir alternatif ise daha az kritik olan bazı özellikleri yeniden gözden geçirip daha sonraki bir aşamaya ertelemektir."},
      {"character_id": "client", "line_ar": "فكرة تأجيل الميزات غير واردة حاليًا. ماذا عن زيادة الفريق؟ ما هو التأثير المتوقع على التكلفة؟", "line_en": "Postponing features is not an option for us right now. What about increasing the team? What would be the anticipated cost impact?", "line_tr": "Özellikleri ertelemek şu anda bizim için bir seçenek değil. Peki ya ekibi artırmak? Beklenen maliyet etkisi ne olur?"},
      {"character_id": "pm", "line_ar": "إذا أضفنا مطورين اثنين بدوام كامل، يمكننا تقليل الجدول الزمني بنسبة 20% تقريبًا، ولكن هذا سيزيد التكلفة الإجمالية بحوالي 15%. هل هذا يتناسب مع توقعاتكم؟", "line_en": "If we add two full-time developers, we could potentially reduce the timeline by about 20%, but this would increase the overall cost by approximately 15%. Would that align with your expectations?", "line_tr": "İki tam zamanlı geliştirici eklersek, zaman çizelgesini potansiyel olarak yaklaşık %20 azaltabiliriz, ancak bu genel maliyeti yaklaşık %15 artırır. Bu beklentilerinizle örtüşür mü?"},
      {"character_id": "client", "line_ar": "نسبة 15% زيادة كبيرة. هل يمكننا النظر في حل وسط؟ ربما إضافة مطور واحد وتمديد طفيف في الجدول الزمني بدلاً من التمديد الكامل الذي اقترحته في البداية؟", "line_en": "A 15% increase is significant. Could we consider a middle ground? Perhaps adding one developer and a slight extension to the timeline instead of the full original extension you proposed?", "line_tr": "%15'lik bir artış önemli. Bir orta yol düşünebilir miyiz? Belki bir geliştirici ekleyip başlangıçta önerdiğiniz tam uzatma yerine zaman çizelgesinde hafif bir uzatma?"},
      {"character_id": "pm", "line_ar": "هذا اقتراح بناء، سيد طارق. إضافة مطور واحد قد يقلل الجدول الزمني بحوالي 10-12%، وزيادة التكلفة ستكون أقل. دعني أعد حسابات الميزانية بناءً على هذا السيناريو وأعود إليك ببيانات دقيقة غدًا.", "line_en": "That's a constructive suggestion, Mr. Tariq. Adding one developer might reduce the timeline by about 10-12%, and the cost increase would be less. Let me recalculate the budget based on this scenario and get back to you with precise figures tomorrow.", "line_tr": "Bu yapıcı bir öneri, Tarık Bey. Bir geliştirici eklemek zaman çizelgesini yaklaşık %10-12 azaltabilir ve maliyet artışı daha az olur. Bu senaryoya göre bütçeyi yeniden hesaplayıp yarın size kesin rakamlarla döneyim."},
      {"character_id": "client", "line_ar": "ممتاز. أتطلع لسماع ذلك. شكرًا على استعدادك للنقاش وإيجاد حلول.", "line_en": "Excellent. I look forward to hearing that. Thank you for your willingness to discuss and find solutions.", "line_tr": "Harika. Bunu duymayı dört gözle bekliyorum. Tartışmaya ve çözüm bulmaya istekli olduğunuz için teşekkür ederim."}
    ]
  },
  "phrases_analysis": [
    {"id": "L01U06_P001", "ar_from_dialogue": "أتفهم مخاوفك بشأن... اسمح لي أن أوضح.", "en_from_dialogue": "I understand your concerns regarding... Allow me to elaborate.", "tr_from_dialogue": "...ile ilgili endişelerinizi anlıyorum. İzninizle açıklayayım.", "focus_ar": "الاعتراف بمخاوف الطرف الآخر وطلب الإذن بالشرح", "focus_en": "Acknowledging other's concerns and asking to elaborate", "focus_tr": "Diğerinin endişelerini kabul etme ve açıklama izni isteme"},
    {"id": "L01U06_P002", "ar_from_dialogue": "هل هناك أي مجال لـ... دون المساس بـ...؟", "en_from_dialogue": "Is there any room to... without compromising...?", "tr_from_dialogue": "...'dan ödün vermeden ...için herhangi bir alan var mı?", "focus_ar": "السؤال عن إمكانية تعديل مع الحفاظ على شرط", "focus_en": "Asking about possibility of modification while maintaining a condition", "focus_tr": "Bir koşulu korurken değişiklik olasılığını sorma"},
    {"id": "L01U06_P003", "ar_from_dialogue": "قد نحتاج إلى...، وهو ما قد يكون له تأثير على...", "en_from_dialogue": "We might need to..., which could have an impact on...", "tr_from_dialogue": "...yapmamız gerekebilir, bu da ...üzerinde bir etki yapabilir.", "focus_ar": "شرح تبعات مقترح معين (باحتمالية)", "focus_en": "Explaining consequences of a proposal (with possibility)", "focus_tr": "Bir önerinin sonuçlarını açıklama (olasılıkla)"},
    {"id": "L01U06_P004", "ar_from_dialogue": "بديل آخر هو أن...", "en_from_dialogue": "Another alternative is to...", "tr_from_dialogue": "Başka bir alternatif ...yapmaktır.", "focus_ar": "تقديم خيار أو حل بديل", "focus_en": "Presenting an alternative option or solution", "focus_tr": "Alternatif bir seçenek veya çözüm sunma"},
    {"id": "L01U06_P005", "ar_from_dialogue": "فكرة... غير واردة حاليًا.", "en_from_dialogue": "The idea of... is not an option for us right now.", "tr_from_dialogue": "...fikri şu anda bizim için bir seçenek değil.", "focus_ar": "رفض اقتراح بشكل حاسم (ولكن مهذب)", "focus_en": "Firmly (but politely) rejecting a suggestion", "focus_tr": "Bir öneriyi kesin (ama kibarca) reddetme"},
    {"id": "L01U06_P006", "ar_from_dialogue": "ما هو التأثير المتوقع على التكلفة؟", "en_from_dialogue": "What would be the anticipated cost impact?", "tr_from_dialogue": "Beklenen maliyet etkisi ne olur?", "focus_ar": "السؤال عن التبعات المالية لاقتراح", "focus_en": "Asking about financial implications of a suggestion", "focus_tr": "Bir önerinin mali sonuçlarını sorma"},
    {"id": "L01U06_P007", "ar_from_dialogue": "هل هذا يتناسب مع توقعاتكم؟ / هل هذا مقبول بالنسبة لكم؟", "en_from_dialogue": "Would that align with your expectations? / Would that be acceptable to you?", "tr_from_dialogue": "Bu beklentilerinizle örtüşür mü? / Bu sizin için kabul edilebilir mi?", "focus_ar": "التحقق من مدى قبول الطرف الآخر لحل مقترح", "focus_en": "Checking the other party's acceptance of a proposed solution", "focus_tr": "Diğer tarafın önerilen bir çözümü kabul edip etmediğini kontrol etme"},
    {"id": "L01U06_P008", "ar_from_dialogue": "هل يمكننا النظر في حل وسط؟", "en_from_dialogue": "Could we consider a middle ground?", "tr_from_dialogue": "Bir orta yol düşünebilir miyiz?", "focus_ar": "اقتراح البحث عن تسوية أو حل وسط", "focus_en": "Suggesting to find a compromise or middle ground", "focus_tr": "Bir uzlaşma veya orta yol bulmayı önerme"},
    {"id": "L01U06_P009", "ar_from_dialogue": "هذا اقتراح بناء. دعني أعد حسابات... وأعود إليك بـ...", "en_from_dialogue": "That's a constructive suggestion. Let me recalculate... and get back to you with...", "tr_from_dialogue": "Bu yapıcı bir öneri. ...yeniden hesaplayıp size ...ile döneyim.", "focus_ar": "قبول اقتراح للمراجعة وتقديم رد لاحقًا", "focus_en": "Accepting a suggestion for review and promising a later response", "focus_tr": "İnceleme için bir öneriyi kabul etme ve daha sonra yanıt verme sözü verme"},
    {"id": "L01U06_P010", "ar_from_dialogue": "أتطلع لسماع ذلك. شكرًا على استعدادك للنقاش.", "en_from_dialogue": "I look forward to hearing that. Thank you for your willingness to discuss.", "tr_from_dialogue": "Bunu duymayı dört gözle bekliyorum. Tartışmaya istekli olduğunuz için teşekkür ederim.", "focus_ar": "إنهاء المفاوضات بشكل إيجابي مع تأكيد التطلع للرد", "focus_en": "Ending negotiation positively, anticipating a response", "focus_tr": "Müzakereyi olumlu bir şekilde sonlandırma, yanıt beklediğini belirtme"}
  ]
}