{
  "id": "L09U03PAR",
  "slug": "cultural-differences-interaction",
  "title_ar": "فروق ثقافية في التواصل: مفاتيح لفهم أعمق",
  "title_en": "Cultural Differences in Interaction: Keys to Deeper Understanding",
  "title_tr": "Etkileşimde Kültürel Farklılıklar: Daha Derin Anlayışın Anahtarları",
  "objective_ar": "التعرف على بعض الفروق الثقافية الهامة في أساليب التواصل بين الثقافات الناطقة بالعربية، الإنجليزية، والتركية، لتجنب سوء الفهم وبناء علاقات أفضل.",
  "objective_en": "Identify some important cultural differences in communication styles among Arabic, English, and Turkish-speaking cultures to avoid misunderstandings and build better relationships.",
  "objective_tr": "Yanlış anlamaları önlemek ve daha iyi ilişkiler kurmak için Arapça, İngilizce ve Türkçe konuşan kültürler arasındaki iletişim tarzlarındaki bazı önemli kültürel farklılıkları belirleyin.",
  "icon_fa_class": "fa-solid fa-globe-europe",
  "scenario": null,
  "phrases": [
    {
      "id": "L09U03_P001",
      "category_ar": "المباشرة مقابل اللباقة",
      "category_en": "Directness vs. Indirectness (Politeness)",
      "category_tr": "Doğrudanlık ve Dolaylılık (Nezaket)",
      "ar": "في بعض الثقافات العربية والتركية، قد يُفضل أسلوب غير مباشر في الطلبات أو الانتقادات للحفاظ على ماء الوجه. في الإنجليزية (خاصة الأمريكية)، غالبًا ما يُقدر التواصل المباشر والواضح.",
      "en": "In some Arabic and Turkish cultures, an indirect style for requests or criticism may be preferred to save face. In English (especially American), direct and clear communication is often valued.",
      "tr": "Bazı Arap ve Türk kültürlerinde, ricalarda veya eleştirilerde itibarı korumak için dolaylı bir üslup tercih edilebilir. İngilizce'de (özellikle Amerikan İngilizcesi'nde) doğrudan ve net iletişim genellikle takdir edilir.",
      "en_note": "Example (EN): Instead of 'Your report has many errors,' try 'Perhaps we could look at a few areas in the report for refinement?' (more indirect and polite).",
      "tr_note": "Örnek (TR): 'Bu fikir kötü' demek yerine, 'Belki başka bir açıdan düşünebilir miyiz?' (daha dolaylı).",
      "audio_ar_tts_key": "المباشرة مقابل اللباقة",
      "audio_en_tts_key": "Directness versus Indirectness",
      "audio_tr_tts_key": "Doğrudanlık ve Dolaylılık"
    },
    {
      "id": "L09U03_P002",
      "category_ar": "أهمية الوقت (Punctuality)",
      "category_en": "Concept of Time (Punctuality)",
      "category_tr": "Zaman Kavramı (Dakiklik)",
      "ar": "مفهوم الالتزام بالوقت يختلف. في بعض الثقافات الغربية (مثل الألمانية والإنجليزية)، الالتزام الدقيق بالوقت مهم جدًا. في ثقافات أخرى (بعض الثقافات العربية أو التركية)، قد يكون هناك مرونة أكبر.",
      "en": "Punctuality varies. In some Western cultures (e.g., German, English), strict punctuality is very important. In others (some Arabic or Turkish contexts), there might be more flexibility.",
      "tr": "Dakiklik kültürden kültüre değişir. Bazı Batı kültürlerinde (örneğin Alman, İngiliz) kesin dakiklik çok önemlidir. Diğerlerinde (bazı Arap veya Türk bağlamlarında) daha fazla esneklik olabilir.",
      "en_note": "If a meeting is at 3 PM in the US/UK, arriving at 3:05 PM might be considered late. Always clarify expectations if unsure.",
      "tr_note": "Türkiye'de resmi toplantılar için genellikle dakik olunması beklenir, ancak sosyal buluşmalarda küçük gecikmeler daha kabul edilebilir olabilir.",
      "audio_ar_tts_key": "أهمية الوقت",
      "audio_en_tts_key": "Concept of Time",
      "audio_tr_tts_key": "Zaman Kavramı"
    },
    {
      "id": "L09U03_P003",
      "category_ar": "المساحة الشخصية والتواصل الجسدي",
      "category_en": "Personal Space and Physical Contact",
      "category_tr": "Kişisel Alan ve Fiziksel Temas",
      "ar": "مقدار المساحة الشخصية المريحة يختلف. المصافحة شائعة، ولكن أنواع أخرى من التواصل الجسدي (مثل التربيت على الظهر) قد لا تكون مقبولة في كل الثقافات أو بين الجنسين.",
      "en": "Comfortable personal space differs. Handshakes are common, but other types of physical contact (like back-patting) may not be acceptable in all cultures or between genders.",
      "tr": "Rahat kişisel alan miktarı farklılık gösterir. Tokalaşma yaygındır, ancak diğer fiziksel temas türleri (sırta vurma gibi) her kültürde veya cinsiyetler arasında kabul edilebilir olmayabilir.",
      "en_note": "Observe and follow the lead of others. When in doubt, maintain a respectful distance.",
      "tr_note": "Türkiye'de, özellikle aynı cinsten arkadaşlar arasında fiziksel temas (örneğin kola dokunma) Batı'ya göre daha yaygın olabilir, ancak bu durum kişiden kişiye değişir.",
      "audio_ar_tts_key": "المساحة الشخصية والتواصل الجسدي",
      "audio_en_tts_key": "Personal Space and Physical Contact",
      "audio_tr_tts_key": "Kişisel Alan ve Fiziksel Temas"
    },
    {
      "id": "L09U03_P004",
      "category_ar": "تقديم وتلقي الهدايا",
      "category_en": "Gift Giving and Receiving",
      "category_tr": "Hediye Verme ve Alma",
      "ar": "آداب تقديم الهدايا تختلف. في بعض الثقافات، من الأدب رفض الهدية مرة أو مرتين قبل قبولها. نوع الهدية وأسلوب تقديمها مهم أيضًا.",
      "en": "Gift-giving etiquette varies. In some cultures, it's polite to refuse a gift once or twice before accepting. The type of gift and presentation also matter.",
      "tr": "Hediye verme adabı değişiklik gösterir. Bazı kültürlerde, bir hediyeyi kabul etmeden önce bir veya iki kez reddetmek kibarlıktır. Hediyenin türü ve sunumu da önemlidir.",
      "en_note": "Research specific cultural norms before offering a gift if traveling or in a multicultural setting.",
      "tr_note": "Türkiye'de misafirliğe giderken genellikle küçük bir hediye (tatlı, çiçek vb.) götürmek adettendir. Hediye genellikle hemen açılmaz.",
      "audio_ar_tts_key": "تقديم وتلقي الهدايا",
      "audio_en_tts_key": "Gift Giving and Receiving",
      "audio_tr_tts_key": "Hediye Verme ve Alma"
    },
    {
      "id": "L09U03_P005",
      "category_ar": "الصمت في المحادثة",
      "category_en": "Silence in Conversation",
      "category_tr": "Sohbette Sessizlik",
      "ar": "في بعض الثقافات (مثل الإنجليزية)، قد يُنظر إلى فترات الصمت الطويلة في المحادثة على أنها محرجة. في ثقافات أخرى، يمكن أن يكون الصمت جزءًا طبيعيًا من الحوار ويعني التفكير.",
      "en": "In some cultures (like English-speaking ones), long silences in conversation might be perceived as awkward. In others, silence can be a natural part of dialogue, indicating thoughtfulness.",
      "tr": "Bazı kültürlerde (İngilizce konuşulanlar gibi), sohbetteki uzun sessizlikler tuhaf karşılanabilir. Diğerlerinde ise sessizlik, düşünceli olmayı gösteren diyaloğun doğal bir parçası olabilir.",
      "en_note": "If you need time to think, you can say: 'That's an interesting point, let me think about that for a moment.'",
      "tr_note": "Türkçe konuşmalarda kısa sessizlikler genellikle normal kabul edilir ve bir sonraki konuşmacıya söz hakkı tanıma veya düşünme fırsatı olarak görülebilir.",
      "audio_ar_tts_key": "الصمت في المحادثة",
      "audio_en_tts_key": "Silence in Conversation",
      "audio_tr_tts_key": "Sohbette Sessizlik"
    }
  ]
}