{
  "id": "L06U03PAR",
  "slug": "making-invitations-accepting-declining",
  "title_ar": "الدعوات: فن توجيه الدعوات وقبولها ورفضها بأدب",
  "title_en": "Invitations: The Art of Extending, Accepting, and Politely Declining",
  "title_tr": "Davetler: Davet Etme, Kabul Etme ve Kibarca Reddetme Sanatı",
  "objective_ar": "تعلم كيفية توجيه الدعوات لمناسبات مختلفة، وكيفية قبول الدعوة أو رفضها بلباقة ووضوح.",
  "objective_en": "Learn how to extend invitations for various occasions, and how to gracefully and clearly accept or decline an invitation.",
  "objective_tr": "Çeşitli durumlar için nasıl davet göndereceğinizi ve bir daveti nasıl zarif ve net bir şekilde kabul edeceğinizi veya reddedeceğinizi öğrenin.",
  "icon_fa_class": "fa-solid fa-envelope-open-text",
  "scenario": {
    "title_ar": "حوار: دعوة لحفل عشاء",
    "title_en": "Dialogue: Invitation to a Dinner Party",
    "title_tr": "Diyalog: Akşam Yemeği Partisine Davet",
    "characters": [
      {"id": "host", "name_ar": "ليلى (المضيفة)", "name_en": "Layla (Host)", "name_tr": "Leyla (Ev Sahibi)"},
      {"id": "guestA", "name_ar": "أحمد (ضيف)", "name_en": "Ahmed (Guest)", "name_tr": "Ahmet (Misafir)"},
      {"id": "guestB", "name_ar": "نورة (ضيفة)", "name_en": "Noura (Guest)", "name_tr": "Nuran (Misafir)"}
    ],
    "dialogue_lines": [
      {"character_id": "host", "line_ar": "أحمد، نورة، كيف حالكما؟ أفكر في إقامة حفل عشاء صغير في منزلي يوم السبت القادم. هل ترغبان في المجيء؟", "line_en": "Ahmed, Noura, how are you both? I'm thinking of hosting a small dinner party at my place next Saturday. Would you like to come?", "line_tr": "Ahmet, Nuran, nasılsınız? Gelecek Cumartesi evimde küçük bir akşam yemeği partisi vermeyi düşünüyorum. Gelmek ister misiniz?"},
      {"character_id": "guestA", "line_ar": "هذا يبدو رائعًا ليلى! أحب جدًا أن آتي. ما هو الوقت التقريبي؟", "line_en": "That sounds wonderful, Layla! I'd love to come. What time aproximativ?", "line_tr": "Kulağa harika geliyor Leyla! Gelmeyi çok isterim. Saat kaç civarında?"},
      {"character_id": "host", "line_ar": "حوالي الساعة الثامنة مساءً. ماذا عنكِ نورة؟ هل جدولكِ يسمح؟", "line_en": "Around 8 PM. How about you, Noura? Does your schedule permit?", "line_tr": "Akşam 8 civarı. Peki ya sen Nuran? Programın uygun mu?"},
      {"character_id": "guestB", "line_ar": "أوه، شكرًا جزيلاً على الدعوة ليلى، هذا لطف منكِ. للأسف، لدي التزام عائلي في ذلك المساء ولن أتمكن من الحضور.", "line_en": "Oh, thank you so much for the invitation, Layla, that's very kind of you. Unfortunately, I have a family commitment that evening and won't be able to make it.", "line_tr": "Ah, davetiniz için çok teşekkür ederim Leyla, çok naziksiniz. Maalesef o akşam bir aile taahhüdüm var ve gelemeyeceğim."},
      {"character_id": "host", "line_ar": "لا مشكلة على الإطلاق نورة، أتفهم تمامًا. ربما في مرة قادمة. أحمد، هل أحضر شيئًا معي؟", "line_en": "No problem at all, Noura, I completely understand. Perhaps next time. Ahmed, shall I bring anything?", "line_tr": "Hiç sorun değil Nuran, tamamen anlıyorum. Belki bir dahaki sefere. Ahmet, bir şey getirmeli miyim?"},
      {"character_id": "guestA", "line_ar": "لا، فقط أحضر نفسك! سيكون كل شيء جاهزًا. أتطلع لرؤيتك.", "line_en": "No, just bring yourself! Everything will be ready. Looking forward to seeing you.", "line_tr": "Hayır, sadece kendini getir! Her şey hazır olacak. Seni görmeyi dört gözle bekliyorum."},
      {"character_id": "host", "line_ar": "(لاحقًا، يتصل أحمد بليلى) ليلى، آسف جدًا، ولكن يبدو أنني سأضطر إلى إلغاء حضوري يوم السبت. ظهر شيء طارئ في العمل.", "line_en": "(Later, Ahmed calls Layla) Layla, I'm so sorry, but it looks like I'll have to cancel for Saturday. Something urgent came up at work.", "line_tr": "(Daha sonra Ahmet Leyla'yı arar) Leyla, çok üzgünüm ama Cumartesi için iptal etmek zorunda kalacağım gibi görünüyor. İşte acil bir durum çıktı."},
      {"character_id": "guestA", "line_ar": "يا للعجب! لا تقلق أحمد، هذه الأشياء تحدث. أتمنى أن يكون كل شيء بخير. يمكننا تحديد موعد آخر قريبًا.", "line_en": "Oh dear! Don't worry, Ahmed, these things happen. I hope everything is okay. We can set another date soon.", "line_tr": "Eyvah! Endişelenme Ahmet, olur böyle şeyler. Umarım her şey yolundadır. Yakında başka bir tarih belirleyebiliriz."}
    ]
  },
  "phrases_analysis": [
    {"id": "L06U03_P001", "ar_from_dialogue": "أفكر في إقامة... / هل ترغب في المجيء؟", "en_from_dialogue": "I'm thinking of hosting... / Would you like to come?", "tr_from_dialogue": "...vermeyi düşünüyorum. / Gelmek ister misin?", "focus_ar": "توجيه دعوة غير رسمية", "focus_en": "Extending an informal invitation", "focus_tr": "Gayri resmi bir davette bulunma", "audio_ar_tts_key": "أفكر في إقامة هل ترغب في المجيء", "audio_en_tts_key": "I'm thinking of hosting. Would you like to come?", "audio_tr_tts_key": "vermeyi düşünüyorum. Gelmek ister misin?"},
    {"id": "L06U03_P002", "ar_from_dialogue": "هذا يبدو رائعًا! أحب جدًا أن آتي.", "en_from_dialogue": "That sounds wonderful! I'd love to come.", "tr_from_dialogue": "Kulağa harika geliyor! Gelmeyi çok isterim.", "focus_ar": "قبول دعوة بحماس", "focus_en": "Enthusiastically accepting an invitation", "focus_tr": "Bir daveti coşkuyla kabul etme", "audio_ar_tts_key": "هذا يبدو رائعا أحب جدا أن آتي", "audio_en_tts_key": "That sounds wonderful! I'd love to come.", "audio_tr_tts_key": "Kulağa harika geliyor! Gelmeyi çok isterim."},
    {"id": "L06U03_P003", "ar_from_dialogue": "شكرًا جزيلاً على الدعوة. للأسف، لدي التزام... ولن أتمكن من الحضور.", "en_from_dialogue": "Thank you so much for the invitation. Unfortunately, I have a commitment... and won't be able to make it.", "tr_from_dialogue": "Davetiniz için çok teşekkür ederim. Maalesef, bir taahhüdüm var... ve gelemeyeceğim.", "focus_ar": "رفض دعوة بأدب مع ذكر سبب (اختياري)", "focus_en": "Politely declining an invitation with a reason (optional)", "focus_tr": "Bir daveti kibarca reddetme (isteğe bağlı olarak sebep belirterek)", "audio_ar_tts_key": "شكرا جزيلا على الدعوة. للأسف لدي التزام ولن أتمكن من الحضور.", "audio_en_tts_key": "Thank you so much for the invitation. Unfortunately, I have a commitment and won't be able to make it.", "audio_tr_tts_key": "Davetiniz için çok teşekkür ederim. Maalesef bir taahhüdüm var ve gelemeyeceğim."},
    {"id": "L06U03_P004", "ar_from_dialogue": "لا مشكلة على الإطلاق، أتفهم تمامًا. ربما في مرة قادمة.", "en_from_dialogue": "No problem at all, I completely understand. Perhaps next time.", "tr_from_dialogue": "Hiç sorun değil, tamamen anlıyorum. Belki bir dahaki sefere.", "focus_ar": "الرد على رفض دعوة بتفهم", "focus_en": "Responding to a declined invitation with understanding", "focus_tr": "Reddedilen bir davete anlayışla karşılık verme", "audio_ar_tts_key": "لا مشكلة على الإطلاق أتفهم تماما ربما في مرة قادمة", "audio_en_tts_key": "No problem at all, I completely understand. Perhaps next time.", "audio_tr_tts_key": "Hiç sorun değil, tamamen anlıyorum. Belki bir dahaki sefere."},
    {"id": "L06U03_P005", "ar_from_dialogue": "هل أحضر شيئًا معي؟ (عند قبول دعوة لعشاء)", "en_from_dialogue": "Shall I bring anything? (when accepting a dinner invitation)", "tr_from_dialogue": "Bir şey getirmeli miyim? (bir akşam yemeği davetini kabul ederken)", "focus_ar": "عرض إحضار شيء كضيف", "focus_en": "Offering to bring something as a guest", "focus_tr": "Misafir olarak bir şeyler getirmeyi teklif etme", "audio_ar_tts_key": "هل أحضر شيئا معي", "audio_en_tts_key": "Shall I bring anything", "audio_tr_tts_key": "Bir şey getirmeli miyim"},
    {"id": "L06U03_P006", "ar_from_dialogue": "آسف جدًا، ولكن يبدو أنني سأضطر إلى إلغاء حضوري.", "en_from_dialogue": "I'm so sorry, but it looks like I'll have to cancel.", "tr_from_dialogue": "Çok üzgünüm ama iptal etmek zorunda kalacağım gibi görünüyor.", "focus_ar": "الاعتذار عن إلغاء حضور مخطط له", "focus_en": "Apologizing for canceling a planned attendance", "focus_tr": "Planlanmış bir katılımı iptal ettiği için özür dileme", "audio_ar_tts_key": "آسف جدا ولكن يبدو أنني سأضطر إلى إلغاء حضوري", "audio_en_tts_key": "I'm so sorry, but it looks like I'll have to cancel.", "audio_tr_tts_key": "Çok üzgünüm ama iptal etmek zorunda kalacağım gibi görünüyor."}
  ]
}